### Library Imports

In [2]:
from pyspark.sql import SparkSession
from pyspark.sql import functions as F

Create a `SparkSession`. No need to create `SparkContext` as you automatically get it as part of the `SparkSession`.

In [3]:
spark = SparkSession.builder \
    .master("local") \
    .appName("Exploring Joins") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()

sc = spark.sparkContext

In [15]:
test_df = spark.createDataFrame(
    [
        (1, 1, 1),
        (1, 2, 1),
        (2, 1, 1),
        (2, 1, 1),
    ], ['id','salt_key', 'amount']
)

test_df.toPandas()

   id  salt_key  amount
0   1         1       1
1   1         2       1
2   2         1       1
3   2         1       1

first aggregate

In [17]:
group_by_cols = ['id']

agg_df = test_df \
    .groupby(group_by_cols + ['salt_key']) \
    .agg(F.sum('amount').alias('amount'))

agg_df.toPandas()

   id  salt_key  amount
0   1         1       1
1   1         2       1
2   2         1       2

second aggregate

In [18]:
agg_df \
    .groupby(group_by_cols) \
    .agg(F.sum('amount').alias('amount')) \
    .toPandas()

   id  amount
0   1       2
1   2       2